{
  "experienciaLaboral": [
    {
      "id": 1,
      "empresa": "Wikan BPO, Medellín",
      "puesto": "FullStack Software Developer",
      "fecha": "Enero 2024 - Septiembre 2024",
      "descripcion": [
        "— Desarrolle e implemente nuevas funcionalidades para la aplicación Appta, un software de gestión del Talento Humano. \n",
        "— Personalice las funcionalidades de Appta según las necesidades específicas de cada negocio. \n",
        "— Trabaje en el desarrollo de un nuevo proyecto de aplicación que tiene el objetivo de facilitar la gestión de pagos de nómina para pequeñas empresas, que optimizara sus procesos financieros y mejorara la eficiencia en el manejo de sus transacciones. \n"
      ]
    },
    {
      "id": 2,
      "empresa": "Comfama, Medellín",
      "puesto": "Frontend Software Developer",
      "fecha": "Febrero 2023 - Julio 2023",
      "descripcion": [
        "— Desarrollé e implementé nuevas funcionalidades destinadas a mejorar significativamente la experiencia del usuario en el portal de servicios del .com.\n",
        "— Realicé pruebas exhaustivas de funcionalidades de manera manual para identificar y solucionar posibles problemas antes de que llegaran a los usuarios finales, garantizando así una experiencia de usuario impecable.\n"
      ]
    },
    {
      "id": 3,
      "empresa": "Wolkvox, Medellín",
      "puesto": "Backend Software Developer",
      "fecha": "Julio 2022 - Diciembre 2022",
      "descripcion": [
        "— Contribuí al desarrollo e implementación de nuevas características fundamentales para el producto Wolkvox Manager, fortaleciendo su funcionalidad y valor para los usuarios.\n",
        "— Desarrollé tableros de estadísticas embebidos para visualizar datos clave de los usuarios en el producto Wolkvox Manager, lo que proporcionó información valiosa para la toma de decisiones y mejoró la usabilidad del producto.\n"
      ]
    },
    {
      "id": 4,
      "empresa": "CESDE, Medellín",
      "puesto": "Microsoft Solution Developer",
      "fecha": "Febrero 2022 - Julio 2022",
      "descripcion": [
        "— Implementé soluciones de automatización de procesos que resultaron en una reducción significativa de los errores humanos, una mayor precisión de los datos y permitieron que los empleados se centraran en tareas de mayor valor.\n",
        "— Desarrollé soluciones de software utilizando la Suite Power Platform de Microsoft para abordar desafíos específicos, optimizando así los flujos de trabajo internos y mejorando la eficiencia operativa de la organización.\n"
      ]
    },
    {
      "id": 5,
      "empresa": "Ingeniería y Encofrados, Sabaneta",
      "puesto": "Analista de Sistemas",
      "fecha": "Julio 2016 - Septiembre 2021",
      "descripcion": [
        "— Realicé análisis de requerimientos para alinear soluciones tecnológicas con las necesidades del negocio.\n",
        "— Gestioné servidores y máquinas virtuales en entornos GNU/Linux y Windows.\n",
        "— Supervisé y gestioné la infraestructura de telefonía IP con FreePBX.\n",
        "— Administré el Directorio Activo, implementando políticas de seguridad sólidas.\n",
        "— Implementé y gestioné soluciones de seguridad, incluyendo el firewall Fortinet.\n",
        "— Supervisé la administración de redes, sistemas de telecomunicaciones y ciberseguridad.\n",
        "— Desarrollé y gestioné la página web y administración de dominios.\n",
        "— Participé en la implementación y administración de las soluciones ERP Siesa Enterprise.\n",
        "— Instalé, configuré y actualicé hardware y software.\n",
        "— Brindé soporte técnico y asesoría a usuarios finales.\n"
      ]
    },
    {
      "id": 6,
      "empresa": "Inversiones Ferbienes, Sabaneta",
      "puesto": "Auxiliar de Sistemas",
      "fecha": "Enero 2015 - Junio 2016",
      "descripcion": [
        "— Implementé actualizaciones y configuraciones en hardware y software.\n",
        "— Realicé mantenimiento regular de equipos informáticos.\n",
        "— Diagnosticaba y resolvía fallas y errores en equipos informáticos.\n",
        "— Brindé soporte técnico y asesoría al usuario final.\n"
      ]
    }
  ],
  "formacion": [
    {
      "id": 1,
      "institucion": "SENA",
      "titulo": "Tecnólogo en Análisis y Desarrollo de Sistemas de Información",
      "fecha": "Febrero 2021 - Febrero 2023"
    },
    {
      "id": 2,
      "institucion": "CESDE",
      "titulo": "Técnico en Desarrollo de Software",
      "fecha": "Febrero 2019 - Diciembre 2020"
    },
    {
      "id": 3,
      "institucion": "CESDE",
      "titulo": "Técnico en Diseño Gráfico Digital",
      "fecha": "Julio 2016 - Julio 2018"
    },
    {
      "id": 4,
      "institucion": "CENSA",
      "titulo": "Técnico en Instalación de Redes y Telecomunicaciones",
      "fecha": "Febrero 2014 - Diciembre 2015"
    }
  ],
  "formacionComplementaria": [
    {
      "id": 1,
      "institucion": "Google on Cousera",
      "titulo": "Ciberseguridad de Google",
      "fecha": "Septiembre 2023 - Febrero 2024"
    },
    {
      "id": 2,
      "institucion": "Google on Cousera",
      "titulo": "Diseño de Experiencia del Usuario de Google",
      "fecha": "Mayo 2023 - Septiembre 2023"
    },
    {
      "id": 3,
      "institucion": "Oracle on Alura latam",
      "titulo": "Oracle Next Education Front-End Developer",
      "fecha": "Abril 2023 - Agosto 2023"
    }
  ],
  "habilidades": [
    {
      "id": 1,
      "tecnologias": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "PHP",
        "SQL",
        "React",
        "Vue",
        "Laravel",
        "APIs REST",
        "SASS",
        "Tailwind",
        "Bootstrap",
        "WordPress",
        "UX/UI",
        "Responsive Design",
        "BEM",
        "Atomic Design",
        "Microsoft Power Platform",
        "Azure DevOps",
        "Git",
        "SCRUM",
        "Agilismo"
      ]
    }
  ]
}